# Banking Customer Segmentation

First we start off by loading the necessary libraries.  
We are also going to use a dotenv file to store our variables such as path to the csv file.

In [11]:
import os
from dotenv import load_dotenv
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

load_dotenv()

True

Load the data as a pandas dataframe

In [18]:
data_path = os.getenv('DATA_PATH')

bank_data = pd.read_csv(data_path)

bank_data

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5
...,...,...,...,...,...,...,...,...,...
1048562,T1048563,C8020229,8/4/90,M,NEW DELHI,7635.19,18/9/16,184824,799.0
1048563,T1048564,C6459278,20/2/92,M,NASHIK,27311.42,18/9/16,183734,460.0
1048564,T1048565,C6412354,18/5/89,M,HYDERABAD,221757.06,18/9/16,183313,770.0
1048565,T1048566,C6420483,30/8/78,M,VISAKHAPATNAM,10117.87,18/9/16,184706,1000.0
1048566,T1048567,C8337524,5/3/84,M,PUNE,75734.42,18/9/16,181222,1166.0

In [19]:
bank_data.count()

TransactionID              1048567
CustomerID                 1048567
CustomerDOB                1045170
CustGender                 1047467
CustLocation               1048416
CustAccountBalance         1046198
TransactionDate            1048567
TransactionTime            1048567
TransactionAmount (INR)    1048567
dtype: int64

In [23]:
bank_data.isna().sum()

TransactionID                 0
CustomerID                    0
CustomerDOB                3397
CustGender                 1100
CustLocation                151
CustAccountBalance         2369
TransactionDate               0
TransactionTime               0
TransactionAmount (INR)       0
dtype: int64

In [26]:
bank_data.dropna(inplace=True)

In [27]:
bank_data.count()

TransactionID              1041614
CustomerID                 1041614
CustomerDOB                1041614
CustGender                 1041614
CustLocation               1041614
CustAccountBalance         1041614
TransactionDate            1041614
TransactionTime            1041614
TransactionAmount (INR)    1041614
dtype: int64

In [44]:
print(bank_data['CustGender'].unique())
print('M:', len(bank_data[bank_data['CustGender'] == 'M']))
print('F:', len(bank_data[bank_data['CustGender'] == 'F']))
print('T:', len(bank_data[bank_data['CustGender'] == 'T']))

['F' 'M']
M: 760978
F: 280635
T: 0

From the above, we see there is only one gender classified as T which doesn't add significant value to the data so we can remove it

In [45]:
bank_data.drop(bank_data[bank_data['CustGender'] == 'T'].index, inplace=True)
print('M:', len(bank_data[bank_data['CustGender'] == 'M']))
print('F:', len(bank_data[bank_data['CustGender'] == 'F']))
print('T:', len(bank_data[bank_data['CustGender'] == 'T']))

M: 760978
F: 280635
T: 0

We observed duplicate customer IDs that have different dates of birth

In [56]:
duplicates = bank_data.pivot_table(index=['CustomerID'], aggfunc='size')
print(duplicates[duplicates > 1].sort_values(ascending=False))

CustomerID
C5533885    6
C4021562    6
C5418253    6
C1736254    6
C7537344    6
           ..
C3873168    2
C3872886    2
C3866488    2
C3866016    2
C9096252    2
Length: 141961, dtype: int64